---
kind: method
id: M:Autodesk.Revit.DB.CylindricalSurface.GetFrameOfReference
source: html/547f05b7-1e57-bc40-8df8-681fb80e61e9.htm
---
# Autodesk.Revit.DB.CylindricalSurface.GetFrameOfReference Method

Returns frame of reference associated with this CylindricalSurface.

## Syntax (C#)
```csharp
public Frame GetFrameOfReference()
```

## Returns
Frame of reference associated with this CylindricalSurface.

## Remarks
This is an equivalent of new Frame(Origin, XDir, YDir, Axis).